read_verilog sumador.v;
hierarchy -check -top sumador;
proc; opt; fsm; opt; memory; opt
techmap; opt;
dfflibmap -liberty cmos_cells.lib;
abc -liberty cmos_cells.lib;
clean;
write_verilog sumador_estructural.v;